In [1]:
#Dependencies
import pandas as pd

In [17]:
# csv_file pathing
living_arrangements_path = "Resource/census_living_arrangements.csv"
marital_status_path = "Resource/marital status overtime.csv"
age_fertility_path = "Resource/Age_Fertility.csv"
education_path = "Resource/Female Education Attainment Level.csv"

In [9]:
# Raw DataFrame Prep: Living Arrangements
living_arrangements_df = pd.read_csv(living_arrangements_path)
print(len(living_arrangements_df))
living_arrangements_df.head()

75

,Year,under_18,two_parents,mother_only,father_only,other_relatives,non_relatives
0,1946,NaN,NaN,NaN,NaN,NaN,NaN
1,1947,NaN,NaN,NaN,NaN,NaN,NaN
2,1948,NaN,NaN,NaN,NaN,NaN,NaN
3,1949,NaN,NaN,NaN,NaN,NaN,NaN
4,1950,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# Raw DataFrame Prep: Marital Status
marital_status_df = pd.read_csv(marital_status_path)
print(len(marital_status_df))
marital_status_df

218

,Year,Men Total,Married Men,Unmarried Men Total,Never Married Men,Widowed Men,Divorced Men,Women Total,Married Women,Unmarried Women Total,Never Married Women,Widowed Women,Divorced Women
0,2019.0,"127,903","68,504","59,399","45,279","3,465","10,655","135,554","69,254","66,300","40,084","11,412","14,804"
1,2018.0,"127,233","67,976","59,257","44,792","3,405","11,060","134,825","68,530","66,294","39,770","11,691","14,833"
2,2017.0,"125,660","67,667","57,993","43,825","3,277","10,891","133,403","68,082","65,320","39,087","11,642","14,591"
3,2016.0,"124,953","66,695","58,256","44,079","3,469","10,708","132,662","67,450","65,213","38,995","11,387","14,831"
4,2015.0,"123,621","66,347","57,274","43,052","3,270","10,952","131,395","67,217","64,179","37,974","11,331","14,874"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
214,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
215,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
216,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
217,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# Raw DataFrame Prep: Fertility by Age
age_fertility_df = pd.read_csv(age_fertility_path)
print(len(age_fertility_df))
age_fertility_df.head()

73

,Year,Age 10-14 Years,Age 15-19 Years,Age 20-24 Years,Age 25-29 Years,Age 30-34 Years,Age 35-39 Years,Age 40-44 Years,Age 45-49 Years,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,1946,0.7,59.3,181.8,161.2,108.9,58.7,16.5,1.5,NaN,NaN,NaN,NaN
1,1947,0.9,79.3,209.7,176.0,111.9,58.9,16.6,1.4,NaN,NaN,NaN,NaN
2,1948,1.0,81.8,200.3,163.4,103.7,54.5,15.7,1.3,NaN,NaN,NaN,NaN
3,1949,1.0,83.4,200.1,165.4,102.1,53.5,15.3,1.3,NaN,NaN,NaN,NaN
4,1950,1.0,81.6,196.6,166.1,103.7,52.9,15.1,1.2,NaN,NaN,NaN,NaN

In [18]:
# Raw DataFrame Prep: Female Education Attainment Level
education_df = pd.read_csv(education_path)
print(len(education_df))
education_df.head()

64

   Years  Total # in thousands   e0 - 4  e5 - 8 hs0 - 3     hs4 c0 - 3     c4
0   1940                 37,313  12.20%  45.00%  15.70%  16.20%  6.00%  3.70%
1   1947                 42,095   9.50%  38.50%  16.50%  22.70%  6.90%  4.60%
2   1950                 44,857   9.80%  35.30%  17.50%  22.50%  7.50%  5.00%
3   1952                 45,990   7.80%  33.50%  17.80%  26.80%  7.70%  5.70%
4   1957                 49,422   8.00%  29.70%  18.10%  29.50%  7.40%  5.70%